//--------------------------------------------------------------------
// 文件名:        GameDefine.h
// 内  容:        游戏定义文件
// 说  明:        定义游戏的一些常量，比如窗口大小等
// 创建日期:        2018年6月6日
//--------------------------------------------------------------------

#pragma once
#include <windows.h>

// 高度
const SHORT GAME_HIGHT = 21;

// 宽度
const SHORT GAME_WIDTH = 38;

// 方块的行数
const SHORT ROWS = 21;

// 方块的列数
const SHORT COLS = 13;

// 运动中的颜色
const WORD COLOR_MOVE = FOREGROUND_RED | FOREGROUND_GREEN | FOREGROUND_INTENSITY;

// 固定不动的颜色
const WORD COLOR_STILL = FOREGROUND_GREEN;

// 空白处的颜色
const WORD COLOR_BLANK = FOREGROUND_RED | FOREGROUND_GREEN | FOREGROUND_BLUE;

// 方块种类
const unsigned int DIAMONDS_TYPES = 7;

// 每个方块有几种变形
const unsigned int DIAMONDS_TRANS = 4;

// 表示单个方块的行数
const unsigned int DIAMONDS_IFNO_ROW = 4;

// 表示单个方块的列数
const unsigned int DIAMONDS_IFNO_COL = 4;

// 消除1行的得分
const int ONE_ROW_SCORE = 100;

// 消除2行的得分
const int TWO_ROWS_SCORE = 300;

// 消除3行的得分
const int THREE_ROWS_SCORE = 700;

// 消除4行的得分
const int FOUR_ROWS_SCORE = 1500;

// 最大分值
const int MAX_SCORE = 99999;

// 得分满，加一个速度
const int SPEED_ADD_SCORE = 10000;

// 默认声效频率
const DWORD DEFAULT_FREQUENCY = 1760;

// 默认声效延续时间
const DWORD DEFAULT_DURATION = 20;

// 超时下落
const DWORD TIME_OUT = 1000;

// 休眠间隔时间(毫秒)
const int SLEEP_TIME = 300;

// 游戏按键对应的索引
enum KeyIndex
{
	GameBegin = 0,    // 游戏开始
	GamePause,        // 游戏暂停
	GameVoice,        // 游戏声效
	Up,                // 方向键-上
	Left,            // 方向键-左
	Right,            // 方向键-右
	Down,            // 方向键-下
	FallDown,        // 方块直接落地

	KeyNum,            // 按键总数
};


// 对应的键值(这个需要查表或者自己实验所得)
enum KeyMap
{
	KEY_ENTER = 13,
	KEY_F1 = 112,
	KEY_LBUTTON = 1,
	KEY_UP = 72,
	KEY_LEFT = 75,
	KEY_RIGHT = 77,
	KEY_DOWN = 40,
	KEY_SPACE = 8,
	KEY_ESC = 27,
};

// 游戏操作定义
enum Cmd
{
	CMD_BEGIN,        // 游戏开始
	CMD_PAUSE,        // 游戏暂停
	CMD_VOICE,        // 游戏声效
	CMD_ROTATE,        // 方块变形
	CMD_LEFT,        // 方块左移
	CMD_RIGHT,        // 方块右移
	CMD_DOWN,        // 方块下移
	CMD_SINK,        // 方块沉底
	CMD_QUIT,        // 游戏退出
};


// 某一行满了
const char FULL_LINE[] = { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 };

// 方块用一个4维数组表示：共7种不同方块，4种变形。每个方块用 4*4 表示。
const char Diamonds[DIAMONDS_TYPES][DIAMONDS_TRANS][DIAMONDS_IFNO_ROW][DIAMONDS_IFNO_COL] =
{
	{
		{ { 0,1,1,0 },{ 1,1,0,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 1,0,0,0 },{ 1,1,0,0 },{ 0,1,0,0 },{ 0,0,0,0 } },
		{ { 0,1,1,0 },{ 1,1,0,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 1,0,0,0 },{ 1,1,0,0 },{ 0,1,0,0 },{ 0,0,0,0 } }
	}
	,
	{
		{ { 1,1,0,0 },{ 0,1,1,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 0,1,0,0 },{ 1,1,0,0 },{ 1,0,0,0 },{ 0,0,0,0 } },
		{ { 1,1,0,0 },{ 0,1,1,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 0,1,0,0 },{ 1,1,0,0 },{ 1,0,0,0 },{ 0,0,0,0 } }
	}
	,
	{
		{ { 1,1,1,0 },{ 1,0,0,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 1,0,0,0 },{ 1,0,0,0 },{ 1,1,0,0 },{ 0,0,0,0 } },
		{ { 0,0,1,0 },{ 1,1,1,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 1,1,0,0 },{ 0,1,0,0 },{ 0,1,0,0 },{ 0,0,0,0 } }
	}
	,
	{
		{ { 1,1,1,0 },{ 0,0,1,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 1,1,0,0 },{ 1,0,0,0 },{ 1,0,0,0 },{ 0,0,0,0 } },
		{ { 1,0,0,0 },{ 1,1,1,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 0,1,0,0 },{ 0,1,0,0 },{ 1,1,0,0 },{ 0,0,0,0 } }
	}
	,
	{
		{ { 1,1,0,0 },{ 1,1,0,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 1,1,0,0 },{ 1,1,0,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 1,1,0,0 },{ 1,1,0,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 1,1,0,0 },{ 1,1,0,0 },{ 0,0,0,0 },{ 0,0,0,0 } }
	}
	,
	{
		{ { 0,1,0,0 },{ 1,1,1,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 0,1,0,0 },{ 1,1,0,0 },{ 0,1,0,0 },{ 0,0,0,0 } },
		{ { 1,1,1,0 },{ 0,1,0,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 1,0,0,0 },{ 1,1,0,0 },{ 1,0,0,0 },{ 0,0,0,0 } }
	}
	,
	{
		{ { 1,1,1,1 },{ 0,0,0,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 1,0,0,0 },{ 1,0,0,0 },{ 1,0,0,0 },{ 1,0,0,0 } },
		{ { 1,1,1,1 },{ 0,0,0,0 },{ 0,0,0,0 },{ 0,0,0,0 } },
		{ { 1,0,0,0 },{ 1,0,0,0 },{ 1,0,0,0 },{ 1,0,0,0 } }
	}
};

// 游戏背景
const char Background[GAME_HIGHT * GAME_WIDTH + 1] =
"┏━━━━━━━━━━━┓┏━━━━┓"
"┃■■■■■■■■■■■┃┃┃        "
"┃■■■■■■■■■■■┃┃┃        "
"┃■■■■■■■■■■■┃┗━━━━┛"
"┃■■■■■■■■■■■┃            "
"┃■■■■■■■■■■■┃ 退出= ESC  "
"┃■■■■■■■■■■■┃            "
"┃■■■■■■■■■■■┃ 开始=      "
"┃■■■■■■■■■■■┃ 暂停=      "
"┃■■■■■■■■■■■┃ 声效=      "
"┃■■■■■■■■■■■┃ 变形=      "
"┃■■■■■■■■■■■┃ 左移=      "
"┃■■■■■■■■■■■┃ 右移=      "
"┃■■■■■■■■■■■┃ 下移=      "
"┃■■■■■■■■■■■┃ 落地=      "
"┃■■■■■■■■■■■┃            "
"┃■■■■■■■■■■■┃            "
"┃■■■■■■■■■■■┃ 速度  得分 "
"┃■■■■■■■■■■■┃┏━━━━┓"
"┃■■■■■■■■■■■┃┃0  00000┃"
"┗━━━━━━━━━━━┛┗━━━━┛";


// 游戏开始时的X坐标
const unsigned int GameStartX = 38;

// 游戏开始时的Y坐标
const unsigned int GameStartY = 21;

